gshau/wxserver/esp8266/ESP_station.cpp
// Import required libraries
#include "ESP_Base64.h"
#include "ESP8266WiFi.h"
#include <WiFiClient.h>
#include <ESP8266WebServer.h>
#include <WiFiUDP.h>
#include <ESP8266mDNS.h>
#include "weatherCalcs.h"
#include <Wire.h>
#include "ESP_httplib.h"
#include <ESP8266HTTPUpdateServer.h>
#include <ArduinoOTA.h>

#include "FS.h"

ESP8266HTTPUpdateServer httpUpdater;


#define QUOTE(name) #name
#define STR(macro) QUOTE(macro)

ESP_httplib esp = ESP_httplib();

#define VERSION "1.0"
// #define BUILD ""


////////////////////////////////////////////////////////////////////////////////////////////////
//////////// DEVICE SPECIFIC HEADERS AND DECLARATIONS //////////////////////////////////////////

#ifdef MCP
  #include "Adafruit_MCP9808.h"
  Adafruit_MCP9808 mcp = Adafruit_MCP9808();
#endif
#ifdef HTU
  #include "Adafruit_HTU21DF.h"
  Adafruit_HTU21DF htu = Adafruit_HTU21DF();
#endif

#ifdef MPL
  #include <Adafruit_MPL3115A2.h>
  Adafruit_MPL3115A2 mpl = Adafruit_MPL3115A2();
#endif

#ifdef INA
  #include <Adafruit_INA219.h>
  Adafruit_INA219 ina219(0x44);
#endif

#ifdef MLX
  #include <Adafruit_MLX90614.h>
  Adafruit_MLX90614 mlx = Adafruit_MLX90614();
#endif



#ifdef SI
  #include "Adafruit_SI1145.h"
  Adafruit_SI1145 si = Adafruit_SI1145();
#endif

#ifdef TMP
  #include "Adafruit_TMP007.h"
  Adafruit_TMP007 tmp(0x43);    // SCL to AD0
#endif

#ifdef TSL
  #include "Adafruit_TSL2591.h"
  Adafruit_TSL2591 tsl = Adafruit_TSL2591(2591);
  void configureSensor(tsl2591Gain_t gainSetting, tsl2591IntegrationTime_t timeSetting);
  float advancedLightSensorRead(void);
#endif

#ifdef SSD
    #include <Adafruit_GFX.h>
    #define OLED_RESET 15
    // #include <Adafruit_SSD1306.h>
    // Adafruit_SSD1306 display(OLED_RESET);
    #include <ESP_SSD1306.h>    // Modification of Adafruit_SSD1306 for ESP8266 compatibility
    ESP_SSD1306 display(OLED_RESET); // FOR I2C

#endif


// #include "Adafruit_LSM9DS0.h"

#ifdef BMP
  #include "Adafruit_BMP183.h"
  #define BMP183_CLK  12  // CLOCK
  #define BMP183_SDO  13  // AKA MISO
  #define BMP183_SDI  14  // AKA MOSI
  #define BMP183_CS   15  // CHIP SELECT
  Adafruit_BMP183 bmp = Adafruit_BMP183(BMP183_CLK, BMP183_SDO, BMP183_SDI, BMP183_CS);
#endif
#ifdef LED
    #ifndef SSD
        #include "Adafruit_LEDBackpack.h"
    #endif
    #include "Adafruit_GFX.h"
    void write4Digit(Adafruit_AlphaNum4 alpha, float num);
    Adafruit_AlphaNum4 alpha4 = Adafruit_AlphaNum4();
#endif
// Adafruit_LSM9DS0 lsm = Adafruit_LSM9DS0();
////////////////////////////////////////////////////////////////////////////////////////////////

float tLast = millis();

unsigned long int tBegin = millis();
float uptime = 0.0;

// WiFi parameters
const char* ssid = "WIFIAP";
const char* password = "PASSWORD";


ESP8266WebServer server(80);
boolean ledOn=true;

WiFiUDP Udp;
int udpPort = 9990;  // udp port
String udpIP = "XX.XX.XX.XX";  // app server ip address
float udpFRQ = 5.;  // update frequency

int rssi;
String dpTemp="mcp";

boolean hasMCP=false,
        hasHTU=false,
        hasBMP=false,
        hasTMP=false,
        hasMPL=false,
        hasALPHNUM=false,
        hasSI=false,
        hasTSL=false,
        hasMLX=false,
        hasINA=false;

static boolean hasLSM=false;

float f,hum,htuT,dp,hi;
float bp, bmpT;
float mplbp,mplT,mplAlt;
float Vshunt, Vbus, Ima, Vload;
float uvI;
float objT,dieT;
float brightness;

Settings settings;

DataSet dataset;
void readSensors(void){

    #ifdef MCP
      f=mcp.readTempC() * 1.8 + 32.0;
    #endif

    #ifdef HTU
      hum=htu.readHumidity();
      htuT=htu.readTemperature() * 1.8 + 32.0;
    #endif

    #ifdef TMP
      objT=tmp.readObjTempC() * 1.8 + 32.0;
      dieT=tmp.readDieTempC() * 1.8 + 32.0;
    #endif

    #ifdef BMP
      bmpT=bmp.getTemperature() * 1.8 + 32.0;
      bp=bmp.getPressure() * 0.0002953;
      float alt = 290.;
      bp = meanSeaLevelPressure(bp, bmpT, alt);

    #endif


    #ifdef INA
      Vshunt = ina219.getShuntVoltage_mV();
      Vbus = ina219.getBusVoltage_V();
      Ima = ina219.getCurrent_mA();
      Vload = Vbus + (Vshunt / 1000.);
      hasINA=true;
    #endif

    #ifdef MPL
      mplbp = mpl.getPressure() * 0.0002953;
      mplT = mpl.getTemperature() * 1.8 + 32.;
      mplAlt = mpl.getAltitude();
      float alt = 292.0;
      mplbp = meanSeaLevelPressure(mplbp, mplT, alt);
    #endif

    #ifdef SI
      uvI = si.readUV();
      uvI /= 100.0;
    #endif

    #ifdef TSL
      brightness = advancedLightSensorRead();
    #endif

    #ifdef MLX
      dieT=mlx.readAmbientTempF();
      objT=mlx.readObjectTempF();

    #endif

      if (dpTemp=="mcp"){
        dp=dewPoint(f,hum);
        hi=heatIndex(f,hum);
      } else if (dpTemp=="htu"){
        dp=dewPoint(htuT,hum);
        hi=heatIndex(htuT,hum);
      }
      rssi = WiFi.RSSI();
      uptime = 0.001 * (millis() - tBegin);
      dataset.nData=0;
    // #ifdef MCP
      if (hasMCP){
          dataset.data[dataset.nData].value=f;
          dataset.data[dataset.nData].name="Temperature";
          dataset.data[dataset.nData].unit="&degF";
          dataset.data[dataset.nData].ul2 = 80.;
          dataset.data[dataset.nData].ul1 = 75.;
          dataset.data[dataset.nData].ll1 = 70.;
          dataset.data[dataset.nData].ll2 = 65.;
          dataset.data[dataset.nData].invertLimits = false;
          dataset.nData++;
      }
    // #endif
    // #ifdef HTU
      if (hasHTU){
          dataset.data[dataset.nData].value=htuT;
          dataset.data[dataset.nData].name="HTU Temp";
          dataset.data[dataset.nData].unit="&degF";
          dataset.data[dataset.nData].ul2 = 80.;
          dataset.data[dataset.nData].ul1 = 75.;
          dataset.data[dataset.nData].ll1 = 70.;
          dataset.data[dataset.nData].ll2 = 65.;
          dataset.data[dataset.nData].invertLimits = false;
          dataset.nData++;

          dataset.data[dataset.nData].value=hum;
          dataset.data[dataset.nData].name="Humidity";
          dataset.data[dataset.nData].unit="%";
          dataset.data[dataset.nData].ul2 = 80.;
          dataset.data[dataset.nData].ul1 = 60.;
          dataset.data[dataset.nData].ll1 = 40.;
          dataset.data[dataset.nData].ll2 = 20.;
          dataset.data[dataset.nData].invertLimits = false;
          dataset.nData++;

          dataset.data[dataset.nData].value=dp;
          dataset.data[dataset.nData].name="Dewpoint";
          dataset.data[dataset.nData].unit="&degF";
          dataset.data[dataset.nData].ul2 = 65.;
          dataset.data[dataset.nData].ul1 = 60.;
          dataset.data[dataset.nData].ll1 = 45.;
          dataset.data[dataset.nData].ll2 = 30.;
          dataset.data[dataset.nData].invertLimits = false;
          dataset.nData++;

          dataset.data[dataset.nData].value=hi;
          dataset.data[dataset.nData].name="Heat Index";
          dataset.data[dataset.nData].unit="&degF";
          dataset.data[dataset.nData].ul2 = 90.;
          dataset.data[dataset.nData].ul1 = 80.;
          dataset.data[dataset.nData].ll1 = 75.;
          dataset.data[dataset.nData].ll2 = -100.;
          dataset.data[dataset.nData].invertLimits = false;
          dataset.nData++;

