gshau/wxserver/esp8266/ESP_station.cpp
      }
    // #endif
    // #ifdef BMP
      if (hasBMP){
          dataset.data[dataset.nData].value=bp;
          dataset.data[dataset.nData].name="Pressure";
          dataset.data[dataset.nData].unit="in-Hg";
          dataset.data[dataset.nData].ul2 = 30.25;
          dataset.data[dataset.nData].ul1 = 30.;
          dataset.data[dataset.nData].ll1 = 29.75;
          dataset.data[dataset.nData].ll2 = 29.5;
          dataset.data[dataset.nData].invertLimits = true;
          dataset.nData++;

          dataset.data[dataset.nData].value=bmpT;
          dataset.data[dataset.nData].name="Pressure Temp";
          dataset.data[dataset.nData].unit="&degF";
          dataset.data[dataset.nData].ul2 = 80.;
          dataset.data[dataset.nData].ul1 = 75.;
          dataset.data[dataset.nData].ll1 = 70.;
          dataset.data[dataset.nData].ll2 = 65.;
          dataset.data[dataset.nData].invertLimits = false;
          dataset.nData++;
      }
      if (hasMPL){
          dataset.data[dataset.nData].value=mplbp;
          dataset.data[dataset.nData].name="Pressure";
          dataset.data[dataset.nData].unit="in-Hg";
          dataset.data[dataset.nData].ul2 = 30.25;
          dataset.data[dataset.nData].ul1 = 30.;
          dataset.data[dataset.nData].ll1 = 29.75;
          dataset.data[dataset.nData].ll2 = 29.5;
          dataset.data[dataset.nData].invertLimits = true;
          dataset.nData++;

          dataset.data[dataset.nData].value=mplT;
          dataset.data[dataset.nData].name="Pressure Temp";
          dataset.data[dataset.nData].unit="&degF";
          dataset.data[dataset.nData].ul2 = 80.;
          dataset.data[dataset.nData].ul1 = 75.;
          dataset.data[dataset.nData].ll1 = 70.;
          dataset.data[dataset.nData].ll2 = 65.;
          dataset.data[dataset.nData].invertLimits = false;
          dataset.nData++;
      }
      if (hasINA){
          dataset.data[dataset.nData].value=Vload;
          dataset.data[dataset.nData].name="Load";
          dataset.data[dataset.nData].unit="V";
          dataset.data[dataset.nData].ul2 = 5.5;
          dataset.data[dataset.nData].ul1 = 5.0;
          dataset.data[dataset.nData].ll1 = 3.4;
          dataset.data[dataset.nData].ll2 = 3.2;
          dataset.data[dataset.nData].invertLimits = false;
          dataset.nData++;


          dataset.data[dataset.nData].value=Ima;
          dataset.data[dataset.nData].name="Current";
          dataset.data[dataset.nData].unit="mA";
          dataset.data[dataset.nData].ul2 = 200;
          dataset.data[dataset.nData].ul1 = 100;
          dataset.data[dataset.nData].ll1 = 50;
          dataset.data[dataset.nData].ll2 = 30;
          dataset.data[dataset.nData].invertLimits = false;
          dataset.nData++;

        }


    // #endif
    // #ifdef SI
      if (hasSI){
          dataset.data[dataset.nData].value=uvI;
          dataset.data[dataset.nData].name="UV Index";
          dataset.data[dataset.nData].unit="";
          dataset.data[dataset.nData].ul2 = 8.0;
          dataset.data[dataset.nData].ul1 = 6.5;
          dataset.data[dataset.nData].ll1 = 5.0;
          dataset.data[dataset.nData].ll2 = 3.0;
          dataset.data[dataset.nData].invertLimits = false;
          dataset.nData++;

      }
    // #endif
    // #ifdef TMP
      if (hasTMP){
          dataset.data[dataset.nData].value=objT;
          dataset.data[dataset.nData].name="IR Temp";
          dataset.data[dataset.nData].unit="&degF";
          dataset.data[dataset.nData].ul2 = 80.;
          dataset.data[dataset.nData].ul1 = 75.;
          dataset.data[dataset.nData].ll1 = 70.;
          dataset.data[dataset.nData].ll2 = 65.;
          dataset.data[dataset.nData].invertLimits = false;
          dataset.nData++;

          dataset.data[dataset.nData].value=dieT;
          dataset.data[dataset.nData].name="TMP Temp";
          dataset.data[dataset.nData].unit="&degF";
          dataset.data[dataset.nData].ul2 = 80.;
          dataset.data[dataset.nData].ul1 = 75.;
          dataset.data[dataset.nData].ll1 = 70.;
          dataset.data[dataset.nData].ll2 = 65.;
          dataset.data[dataset.nData].invertLimits = false;
          dataset.nData++;

          dataset.data[dataset.nData].value=dieT - objT;
          dataset.data[dataset.nData].name="IR dT";
          dataset.data[dataset.nData].unit="&degF";
          dataset.data[dataset.nData].ul2 = 25.;
          dataset.data[dataset.nData].ul1 = 20.;
          dataset.data[dataset.nData].ll1 = 15.;
          dataset.data[dataset.nData].ll2 = 10.;
          dataset.data[dataset.nData].invertLimits = true;
          dataset.nData++;

      }

      if (hasMLX){
          dataset.data[dataset.nData].value=objT;
          dataset.data[dataset.nData].name="IR Temp";
          dataset.data[dataset.nData].unit="&degF";
          dataset.data[dataset.nData].ul2 = 80.;
          dataset.data[dataset.nData].ul1 = 75.;
          dataset.data[dataset.nData].ll1 = 70.;
          dataset.data[dataset.nData].ll2 = 65.;
          dataset.data[dataset.nData].invertLimits = false;
          dataset.nData++;

          dataset.data[dataset.nData].value=dieT;
          dataset.data[dataset.nData].name="MLX Temp";
          dataset.data[dataset.nData].unit="&degF";
          dataset.data[dataset.nData].ul2 = 80.;
          dataset.data[dataset.nData].ul1 = 75.;
          dataset.data[dataset.nData].ll1 = 70.;
          dataset.data[dataset.nData].ll2 = 65.;
          dataset.data[dataset.nData].invertLimits = false;
          dataset.nData++;

          dataset.data[dataset.nData].value=dieT - objT;
          dataset.data[dataset.nData].name="IR dT";
          dataset.data[dataset.nData].unit="&degF";
          dataset.data[dataset.nData].ul2 = 25.;
          dataset.data[dataset.nData].ul1 = 20.;
          dataset.data[dataset.nData].ll1 = 15.;
          dataset.data[dataset.nData].ll2 = 10.;
          dataset.data[dataset.nData].invertLimits = true;
          dataset.nData++;

      }
// #endif
    // #ifdef TSL
      if (hasTSL){
          dataset.data[dataset.nData].value=brightness;
          dataset.data[dataset.nData].name="Brightness";
          dataset.data[dataset.nData].unit="lux";
          dataset.data[dataset.nData].ul2 = 100000.;
          dataset.data[dataset.nData].ul1 = 10000.;
          dataset.data[dataset.nData].ll1 = 1000.;
          dataset.data[dataset.nData].ll2 = 100.;
          dataset.data[dataset.nData].invertLimits = false;
          dataset.nData++;

