gshau/wxserver/esp8266/ESP_station.cpp
      }
    // #endif

      dataset.data[dataset.nData].value=uptime;
      dataset.data[dataset.nData].name="uptime";
      dataset.data[dataset.nData].unit="s";
      dataset.data[dataset.nData].ul2 = 80.;
      dataset.data[dataset.nData].ul1 = 75.;
      dataset.data[dataset.nData].ll1 = 70.;
      dataset.data[dataset.nData].ll2 = 65.;
      dataset.data[dataset.nData].invertLimits = false;
      dataset.nData++;

      dataset.data[dataset.nData].value=rssi;
      dataset.data[dataset.nData].name="RSSI";
      dataset.data[dataset.nData].unit="dBm";
      dataset.data[dataset.nData].ul2 = -20.;
      dataset.data[dataset.nData].ul1 = -40.;
      dataset.data[dataset.nData].ll1 = -60.;
      dataset.data[dataset.nData].ll2 = -70.;
      dataset.data[dataset.nData].invertLimits = true;
      dataset.nData++;




}



void udpSendPacket(void);



////////////////////////////////////////////////////////////////////////
// Webserver handling
////////////////////////////////////////////////////////////////////////
void handle_root() {
    Settings settings;
    settings.udpFRQ=udpFRQ;
    settings.udpIP=udpIP;
    settings.udpPort=udpPort;
    esp.http.settings = settings;


  esp.http.updatePage(dataset, esp.packet);
  server.send(200, "text/html", esp.http.page());
}

void handle_post(){
    esp.formPacket(dataset);
 //    server.send(200, "application/json", esp.packet);            // send to someones browser when asked
    server.send(200, "text/html", "<meta http-equiv=\"refresh\" content=\"1; URL='http://" + esp.stationIP + "'\" />");            // send to someones browser when asked
    Serial.println("Sent packet for temp");

    for (uint8_t i=0; i<server.args(); i++){
      if (server.argName(i)== "udpFRQ"){
        Serial.println("Updated " + server.argName(i) + " to: " + server.arg(server.argName(i)));
        udpFRQ=server.arg("udpFRQ").toFloat();
        esp.http.settings.udpFRQ = udpFRQ;
      }
      if (server.argName(i)== "dpTemp"){
        Serial.println("Updated " + server.argName(i) + " to: " + server.arg(server.argName(i)));
        dpTemp=server.arg("dpTemp");
        // settings.udpFRQ = udpFRQ;
      }
      if (server.argName(i)== "udpPort"){
        Serial.println("Updated " + server.argName(i) + " to: " + server.arg(server.argName(i)));
        udpPort=server.arg("udpPort").toInt();
        esp.http.settings.udpPort = udpPort;
      }
      if (server.argName(i)== "udpIP"){
        Serial.println("Updated " + server.argName(i) + " to: " + server.arg(server.argName(i)));
        udpIP=server.arg("udpIP");
        esp.http.settings.udpIP = udpIP;
      }
    }
}


void handle_data(){
    esp.formPacket(dataset);
    server.send(200, "application/json", esp.packet);            // send to someones browser when asked
    Serial.println("Sent packet for temp");
}


void handle_reset(){
    server.send(200, "text/html", "<meta http-equiv=\"refresh\" content=\"3; URL='http://" + esp.stationIP + "'\" />");            // send to someones browser when asked
    Serial.println("Reset requested");
    esp.triggerReset();
}

void handle_ledOff(){
    ledOn=false;
    server.send(200, "text/html", "<meta http-equiv=\"refresh\" content=\"0; URL='http://" + esp.stationIP + "'\" />");
}
void handle_ledOn(){
    ledOn=true;
    server.send(200, "text/html", "<meta http-equiv=\"refresh\" content=\"0; URL='http://" + esp.stationIP + "'\" />");
}


void handle_spiffs(){
    SPIFFS.begin();

    File f = SPIFFS.open("/test.html", "r");
    if (!f) {
        Serial.println("file open failed");
    } else{

      // Serial.println(f.readString());
      server.send(200, "text/html", f.readString());
    }
}


////////////////////////////////////////////////////////////////////////
// Setup
////////////////////////////////////////////////////////////////////////
void setup(void)
{
  Wire.begin();
  Wire.pins(4, 0);
  // Start Serial
  Serial.begin(115200);

  esp.begin(ssid, password);
  //  esp.http.begin();
  esp.http.stationName = STR(NAME);//"Development Server";
  esp.http.version = VERSION;
  esp.http.begin();
  esp.http.updatePage(dataset, esp.packet);

#ifdef SSD
  display.begin(SSD1306_SWITCHCAPVCC, 0x3D);  // initialize with the I2C addr 0x3D (for the 128x64)
  display.setTextSize(0);
  display.setTextColor(WHITE);
  int line = 0;
// delay(2000);


#endif


  server.on("/", handle_root);

  server.on("/data", handle_data);

  server.on("/post", handle_post);

  server.on("/reset", handle_reset);

  server.on("/ledOff", handle_ledOff);
  server.on("/ledOn", handle_ledOn);

  server.on("/spiffs", handle_spiffs);

  httpUpdater.setup(&server);
  server.begin();
  Serial.println("HTTP server started");

  // MDNS.addService("http", "tcp", 80);
  // if (!MDNS.begin("snazzy")) {
  //   Serial.println("Error setting up MDNS responder!");
  //   while(1) {
  //     delay(1000);
  //   }
  // }
  // Serial.println("mDNS responder started");


#ifdef MCP
  if (mcp.begin()) {
    Serial.println("Found MCP sensor");
    hasMCP=true;
  }
#endif

#ifdef HTU
  if (htu.begin()) {
    Serial.println("Found HTU sensor");
    hasHTU=true;
  }
#endif

#ifdef BMP
  if (bmp.begin()) {
    Serial.println("Found BMP sensor");
    hasBMP=true;
  }
#endif

#ifdef TMP
  if (tmp.begin()) {
    Serial.println("Found TMP sensor");
    hasTMP=true;
  }
#endif

#ifdef MLX
  Serial.println("MLX sensor requested");
  mlx.begin();
  hasMLX=true;
#endif

#ifdef SI
 Serial.println("SI requested");
  if (si.begin()) {
    Serial.println("Found SI sensor");
    hasSI=true;
  }
  hasSI=true;
#endif

#ifdef TSL
  if (tsl.begin()) {
    Serial.println("Found TSL sensor");
    configureSensor(TSL2591_GAIN_LOW, TSL2591_INTEGRATIONTIME_100MS);
    hasTSL=true;
  }
#endif

#ifdef INA
  Serial.println("INA sensor requested");
  ina219.begin();
  hasINA=true;
#endif

#ifdef MPL
  if (mpl.begin()) {
    Serial.println("Found MPL sensor");
    hasMPL=true;
  }
#endif

#ifdef LED
    alpha4.begin(0x70);  // pass in the address
#endif

  Serial.println("Finished uploading sensors");
  //

  // Hostname defaults to esp8266-[ChipID]
  ArduinoOTA.setHostname("snazz-face");

