gshau/wxserver/esp8266/ESP_station.cpp
    };
    void write4Digit(Adafruit_AlphaNum4 alpha, float num){
      int digit,indx;
      int lognumIndx = int(log10(num));



      for (indx=3; indx>=0; indx--){
        int digit = int(num * pow(10.0,-lognumIndx+indx)) % 10;
        char buff[1];
        itoa(digit,buff,10);
    //    Serial.print(indx);
    //   Serial.print( buff[0]);
    //   Serial.println();
           alpha.writeDigitAscii(indx,buff[0]);
        if (indx == lognumIndx) {
           alpha.writeDigitRaw(indx,0x4000+pgm_read_word(alphafonttable+buff[0]));
        }
      }
    //  Serial.println();
      alpha4.clear();
      alpha.writeDisplay();


    }
#endif


#ifdef TSL
void configureSensor(tsl2591Gain_t gainSetting, tsl2591IntegrationTime_t timeSetting)
{
  // You can change the gain on the fly, to adapt to brighter/dimmer light situations
  tsl.setGain(gainSetting);
  //tsl.setGain(TSL2591_GAIN_LOW);    // 1x gain (bright light)
  //tsl.setGain(TSL2591_GAIN_MED);      // 25x gain
  //tsl.setGain(TSL2591_GAIN_HIGH);   // 428x gain

  // Changing the integration time gives you a longer time over which to sense light
  // longer timelines are slower, but are good in very low light situtations!
  tsl.setTiming(timeSetting);
  //tsl.setTiming(TSL2591_INTEGRATIONTIME_100MS);  // shortest integration time (bright light)
  //tsl.setTiming(TSL2591_INTEGRATIONTIME_200MS);
  //tsl.setTiming(TSL2591_INTEGRATIONTIME_300MS);
  //tsl.setTiming(TSL2591_INTEGRATIONTIME_400MS);
  //tsl.setTiming(TSL2591_INTEGRATIONTIME_500MS);
  //tsl.setTiming(TSL2591_INTEGRATIONTIME_600MS);  // longest integration time (dim light)

  /* Display the gain and integration time for reference sake */
  // XBee.println("------------------------------------");
  // XBee.print  ("Gain:         ");
  tsl2591Gain_t gain = tsl.getGain();
  // switch(gain)
  // {
  // case TSL2591_GAIN_LOW:
  //   XBee.println("1x (Low)");
  //   break;
  // case TSL2591_GAIN_MED:
  //   XBee.println("25x (Medium)");
  //   break;
  // case TSL2591_GAIN_HIGH:
  //   XBee.println("428x (High)");
  //   break;
  // case TSL2591_GAIN_MAX:
  //   XBee.println("9876x (Max)");
  //   break;
  // }
  // XBee.print  ("Timing:       ");
  // XBee.print((tsl.getTiming() + 1) * 100, DEC);
  // XBee.println(" ms");
  // XBee.println("------------------------------------");
  // XBee.println("");
}

float advancedLightSensorRead(void)
{
  // More advanced data read example. Read 32 bits with top 16 bits IR, bottom 16 bits full spectrum
  // That way you can do whatever math and comparisons you want!
  uint32_t lum = tsl.getFullLuminosity();
  uint16_t ir, full;
  float lux;
  lum = tsl.getFullLuminosity(); // first reading will be incorrect of Gain or Time was changed
  ir = lum >> 16;
  full = lum & 0xFFFF;
  lux = tsl.calculateLux(full, ir);
//  XBee.println();
//  XBee.print(F("Lux "));
//  XBee.println(lux);

  if (full < 100){
    switch (tsl.getGain())
    {
    case TSL2591_GAIN_LOW :
      configureSensor(TSL2591_GAIN_MED, TSL2591_INTEGRATIONTIME_200MS);
      // XBee.print(F("Gain raised to MED"));
      break;
    case TSL2591_GAIN_MED :
      configureSensor(TSL2591_GAIN_HIGH, TSL2591_INTEGRATIONTIME_200MS);
      // XBee.print(F("Gain raised to HIGH"));
      break;
      /*        case TSL2591_GAIN_HIGH :
       configureSensor(TSL2591_GAIN_MAX, TSL2591_INTEGRATIONTIME_200MS);
       XBee.print("Gain raised to MAX");
       break;
       case TSL2591_GAIN_MAX :
       XBee.print("Gain already at MAX");
       break;
       */
    default:
      configureSensor(TSL2591_GAIN_MED, TSL2591_INTEGRATIONTIME_200MS);
      break;
    }

  }

  if (full > 30000){
    switch (tsl.getGain())
    {
    case TSL2591_GAIN_LOW :
      // XBee.print(F("Gain already at LOW"));
      break;
    case TSL2591_GAIN_MED :
      configureSensor(TSL2591_GAIN_LOW, TSL2591_INTEGRATIONTIME_200MS);
      // XBee.print(F("Gain lowered to LOW"));
      break;
      /*        case TSL2591_GAIN_HIGH :
       configureSensor(TSL2591_GAIN_MED, TSL2591_INTEGRATIONTIME_200MS);
       XBee.print("Gain lowered to MED");
       break;
       case TSL2591_GAIN_MAX :
       configureSensor(TSL2591_GAIN_HIGH, TSL2591_INTEGRATIONTIME_200MS);
       XBee.print("Gain lowered to MED");
       break;
       */
    default:
      configureSensor(TSL2591_GAIN_MED, TSL2591_INTEGRATIONTIME_200MS);
      break;
    }

  }
  return lux;

}
#endif
